## 1. Информация

*Информация* -- сведения независимо от формы их представления ; определенность

*Бит* -- единица измерения *информации* ; минимальное количество *информации*, необходимое для ликвидации минимальной неопределенности

В электронике одному *биту* соответствует один двоичный триггер (устройство, имеющее 2 взаимоисключающих возможных состояния)

Биту соответствует `2^1`, т.е. `2` различных значения

**Сколько различных значений соответствует 2-ум битам? 5 битам?**

*Байт* -- 8 *бит*

Байту соответствует `2^8`, т.е. `256` различных значений

Информацию размером `1` *байт* можно представить в виде `2`-ух символов, каждый из которых может принимать одно из `2^4 = 16` значений:

* одна из 10 цифр: `0`, `1`, `2`, `3`, `4`, `5`, `6`, `7`, `8`, `9`
* одна из 6 букв: `A`, `B`, `C`, `D`, `E`, `F`

Такая запись называется 16-ричной



## 2. Программы

*Программа* -- комбинация компьютерных *инструкций* и *данных*, позволяющая аппаратному обеспечению выполнять вычисления или функции управления

*Язык программирования* -- набор правил записи *исходного кода* программ

Примеры языков программирования -- `C`, `C++`, `Python`, `Lua`, `JavaScript`

*Исходный код* программы -- текст, соответствующий правилам определённого *языка программирования*. Включает определения, операторы и инструкции, необходимые для решения определенной задачи

**Является ли исходный код языком программирования?**

**Является ли программа исходным кодом? Является ли исходный код программой?**

Примеры исходного кода: [C](https://github.com/MentalBlood/Marasmatic), [C++](https://github.com/MentalBlood/gorage/tree/79733ea94277cefe2b548129dcf827e6d897257d), [Python](https://github.com/MentalBlood/bandasync), [Lua](https://github.com/MentalBlood/keyfinity), [JavaScript](https://github.com/MentalBlood/typer)

*Транслятор* -- средство, выполняющее преобразование *исходного кода* *программы* на одном из языков *программирования*, в *исходный код* *программы* на другом *языке программирования*

*Машинный код* -- код, выполняющийся непосредственно физическим устройством (процессором)

Пример машинного кода (в 16-ричном представлении):

```
BB 11 01 B9 0D 00 B4 0E 8A 07 43 CD 10 E2 F9 CD 20 48 65 6C 6C 6F 2C 20 57 6F 72 6C 64 21
```

*Трансляция* в *машинный код* называется *компиляцией*

*Трансляция* в *исходный код* называется *интерпретацией*

**Является ли машинной код исходным кодом? Почему?**

**Является ли компиляция интерпретацией?**



## 3. Язык Си

### 3.1 Введение

Исходный код программы на языке Си состоит из *функций* и *переменных*. *Функции* содержат *инструкции*, описывающие вычисления, которые необходимо выполнить, а *переменные* хранят значения, используемые в процессе этих вычислений

Пример программы на языке Си:

```C
#include <stdio.h>

int main() {
	printf("Hello, world!");
	return 0;
}
```

### 3.2 Алфавит

В языке Си используются все символы латинского алфавита: `ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz`

цифры: `0123456789`

и некоторые специальные символы: `, ;.+-*^&=~!/<>(){}[]|%?'":_\#`

### 3.3 Идентификаторы

В языке Си допустимыми идентификаторами произвольные являются слова, в состав которых могут входить символы латинского алфавита, цифры и знак подчёркивания. Идентификаторы даются операторам, константам, переменным, типам и функциям

Примеры идентификаторов: `name`, `value_size`, `renderParamList`, `ACTION_PARAM`, `_line`

**Чему могут быть даны идентификаторы из примеров -- операторам, константам, переменным, типам или функциям? Чему они скорее всего даны?**

### 3.4 Управляющие операторы

#### 3.4.1 Основные управляющие операторы

`;` -- *пустой оператор*, соответствует бездействию

*(выражение)*`;` -- *инструкция*, некое элементарное действие, соответствующее выражению. Несколько идущих подряд инструкций образуют *последовательность инструкций*

Примеры выражений: `int amount;` `number = 1;`, `i;`, `D >= 0;`

```C
{
	(последовательность инструкций)
}
```
-- *блок инструкций*

#### 3.4.2 Условные операторы

Простая форма:

`if (`*(условие)*`)` *(оператор)*

Пример простой формы:

```C
if (D < 0) return 1;
```

**Что обязательно выполнится в простой форме? Что не обязательно выполнится?**

**Чем является условие -- инструкцией, оператором, или чем-то еще?**

Полная форма:

`if (`*(условие)*`)` *(оператор)* `else` *(альтернативный оператор)*

Пример полной формы:

```C
if (!temp) {
	exit_render_();
} else {
	target = temp;
}
```

**Что обязательно выполнится в полной форме? Что -- не обязательно?**

#### 3.4.3 Операторы выполнения цикла

Цикл -- это фрагмент кода, содержащий:

* Условие выполнения цикла
* Тело цикла -- оператор, выполнение которого зависит от условия цикла

Цикл может быть:

* С предусловием, т.е. сначала проверяется условие выполнения цикла, и если оно верно, то выполняется тело цикла
* С постусловием, т.е. сначала выполняется тело цикла, а продолжение выполнения цикла зависит от условия

**Сколько раз может выполниться тело цикла с предусловием? С постусловием?**